Requests_control/src/InformationRegisters/ВнешниеИсточникиДокументов/ВнешниеИсточникиДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВнешниеИсточникиДокументов</name>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.Обращения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Requests_control/src/InformationRegisters/ВнешниеИсточникиДокументов/ManagerModule.bsl
// Запоминает связь загруженного документа с внешним идентификатором,
// например идентификатором письма, в регистре сведений ВнешниеИсточникиДокументов
//
// Параметры:
// - Документ (ВходящийДокумент, ИсходящийДокумент, ВнутреннийДокумент, ВходящийДокумент)
// - Идентификатор (Строка)
//
Процедура ЗарегистрироватьВнешнийИсточникДокумента(Документ, Идентификатор) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Если ПустаяСтрока(Идентификатор) Тогда
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Документ) Тогда
		Возврат;
	КонецЕсли;
	
	Запись = РегистрыСведений.ВнешниеИсточникиДокументов.СоздатьМенеджерЗаписи();
	Запись.Идентификатор = Идентификатор;
	Запись.Документ = Документ;
	Запись.Прочитать();
	Запись.Идентификатор = Идентификатор;
	Запись.Документ = Документ;
	Запись.Записать(Истина);
	
КонецПроцедуры
